#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_cloud_run_service_iam_binding.invoke-api-binding: Refreshing state... [id=v1/projects/practice-cicd-mtk/locations/us-central1/services/api-run/roles/run.invoker]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/compute.googleapis.com]
google_compute_network.vpc_network: Refreshing state... [id=projects/practice-cicd-mtk/global/networks/cicd-network]
google_service_account.api-invoker: Refreshing state... [id=projects/practice-cicd-mtk/serviceAccounts/api-invoker@practice-cicd-mtk.iam.gserviceaccount.com]
google_project_service.service["containerregistry.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/containerregistry.googleapis.com]
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/run.googleapis.com]
google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/iam.googleapis.com]
google_cloud_run_service.api-run: Refreshing state... [id=locations/us-central1/namespaces/practice-cicd-mtk/services/api-run]
google_project_iam_member.allow-token-create-for-cloud-run: Refreshing state... [id=practice-cicd-mtk/roles/iam.serviceAccountTokenCreator/serviceaccount:api-invoker@practice-cicd-mtk.iam.gserviceaccount.com]
google_compute_firewall.frontend: Refreshing state... [id=projects/practice-cicd-mtk/global/firewalls/http-firewall]
google_compute_firewall.develop: Refreshing state... [id=projects/practice-cicd-mtk/global/firewalls/ssh-firewall]
google_compute_instance.nginx_instance: Refreshing state... [id=projects/practice-cicd-mtk/zones/us-central1-c/instances/reverse-proxy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_project_iam_member.allow-token-create-for-cloud-run has been changed
  ~ resource "google_project_iam_member" "allow-token-create-for-cloud-run" {
      ~ etag    = "BwXKQik7m6k=" -> "BwXKQmEkeOU="
        id      = "practice-cicd-mtk/roles/iam.serviceAccountTokenCreator/serviceaccount:api-invoker@practice-cicd-mtk.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_cloud_run_service.api-run will be updated in-place
  ~ resource "google_cloud_run_service" "api-run" {
        id       = "locations/us-central1/namespaces/practice-cicd-mtk/services/api-run"
        name     = "api-run"
        # (3 unchanged attributes hidden)


      ~ template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                  - "run.googleapis.com/sandbox"       = "gvisor"
                } -> null
              - generation  = 0 -> null
              - labels      = {} -> null
            }

          ~ spec {
              - container_concurrency = 80 -> null

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service_iam_binding.invoke-api-binding will be destroyed
  - resource "google_cloud_run_service_iam_binding" "invoke-api-binding" {
      - etag     = "BwXKN0dNsHI=" -> null
      - id       = "v1/projects/practice-cicd-mtk/locations/us-central1/services/api-run/roles/run.invoker" -> null
      - location = "us-central1" -> null
      - members  = [
          - "serviceAccount:api-invoker@practice-cicd-mtk.iam.gserviceaccount.com",
        ] -> null
      - project  = "practice-cicd-mtk" -> null
      - role     = "roles/run.invoker" -> null
      - service  = "v1/projects/practice-cicd-mtk/locations/us-central1/services/api-run" -> null
    }

  # google_cloud_run_service_iam_binding.invokeer will be created
  + resource "google_cloud_run_service_iam_binding" "invokeer" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + members  = [
          + "serviceAccount:api-invoker@practice-cicd-mtk.iam.gserviceaccount.com",
        ]
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "api-run"
    }

  # google_project_iam_member.allow-token-create-for-cloud-run will be destroyed
  - resource "google_project_iam_member" "allow-token-create-for-cloud-run" {
      - etag    = "BwXKQmEkeOU=" -> null
      - id      = "practice-cicd-mtk/roles/iam.serviceAccountTokenCreator/serviceaccount:api-invoker@practice-cicd-mtk.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:api-invoker@practice-cicd-mtk.iam.gserviceaccount.com" -> null
      - project = "practice-cicd-mtk" -> null
      - role    = "roles/iam.serviceAccountTokenCreator" -> null
    }

  # google_project_iam_member.allow-token-create-for-cloud-run["serviceAccount:api-invoker@practice-cicd-mtk.iam.gserviceaccount.com"] will be created
  + resource "google_project_iam_member" "allow-token-create-for-cloud-run" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:api-invoker@practice-cicd-mtk.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marltake, Action: `pull_request`, Working Directory: ``, Workflow: `terraform CI/CD`*